using Notebook.Enums;
using Notebook.Models;
using System.Text;

class BirthdayMessageCreator
{
    public string CreateFor(NotebookEntry entry)
    {
        StringBuilder builder = new ();

        builder.Append(new string('=', 40));
        builder.Append($@"
Шановний/Шановна {entry.Name},

З нагоди вашого дня народження, я бажаю вам найщиріших вітань! Цей особливий день є чудовою нагодою відзначити ваше народження і висловити свою вдячність за ваше існування. Ви є важливою людиною у нашому колективі/родині/друзів, і ваша присутність завжди збагачує наше життя.

Бажаю вам безмежного щастя, здоров'я та успіхів у всіх сферах вашого життя. Нехай кожен наступний рік принесе вам нові можливості та незабутні пригоди. Бажаю вам міцного здоров'я, щоб здійснювати свої мрії та досягати поставлених цілей.

Нехай ваш день народження буде сповнений радості, сміху та любові від рідних та близьких. Це також час для самовдосконалення та задуму над майбутніми планами. Відкрийте для себе нові горизонти, здійснюйте свої мрії та насолоджуйтесь кожним моментом цього особливого дня.

Знову ж бажаю вам щирого щастя і задоволення від життя. Нехай ваш день народження стане початком нового року, наповненого незабутніми моментами та благополуччям. Зичу вам щирого здійснення всіх бажань і натхнення для досягнення великих висот.
        ");
        builder.Append(new string('=', 40));
        builder.Append("Адреса відправлення: " + entry.Adresses.FirstOrDefault());
        builder.Append("Номер телефону: " + entry.PhoneNumberCollection.Get(PhoneNumberType.Personal));

        return builder.ToString();
    }
}